"""
Завдання 2 – Рослини проти Зомбі

Створіть функцію, яка прийматиме два масиву несортованих чисел (перший - масив рослин, що захищається, другий - атакуючий масив зомбі) і поверне boolean значення в залежність від того чи перемогли захисники.

➡️ Умови:

Кожен елемент масиву атакує елемент іншого масиву з тим самим індексом масиву. Той, хто вижив, - це число з найбільшим значенням.
Якщо значення однакове, вони обидва гинуть.
Якщо одне із значень відсутнє (різна довжина масивів), солдат з непустим значенням виживає.
Щоб вижити, сторона, що обороняється, повинна мати більше тих, хто вижив, ніж атакуюча сторона.
У випадку, якщо з обох боків однакова кількість людей, що вижили, перемагає команда з найбільшою початковою силою атаки. Якщо загальна сила атаки з обох сторін однакова, поверніть True.
Початкова сила атаки є сумою всіх значень у кожному масиві.
Тести:

zombies=[ 1, 3, 5, 7 ] plants=[ 2, 4, 6, 8 ] -> True
zombies=[ 1, 3, 5, 7 ] plants=[ 2, 4 ] -> False
zombies=[ 1, 3, 5, 7 ] plants=[ 2, 4, 0, 8 ] -> True
zombies=[ 2, 1, 1, 1 ] plants=[ 1, 2, 1, 1 ] -> True
"""